Q11. Create Student Table with ID as Primary Key and NOT NULL , Name as 20 Characters ,Age as Int value both are NOT NULL and Address have  25 charter And Insert Any 5 Records?

In [1]:
'''
-- Create the Student table
CREATE TABLE Student (
    ID INT PRIMARY KEY NOT NULL,
    Name VARCHAR(20) NOT NULL,
    Age INT NOT NULL,
    Address VARCHAR(25)
);

-- Insert records into the Student table
INSERT INTO Student (ID, Name, Age, Address)
VALUES (1, 'Alice', 20, '123 Main St'),
       (2, 'Bob', 22, '456 Elm St'),
       (3, 'Carol', 21, '789 Oak Ave'),
       (4, 'David', 23, '567 Pine Rd'),
       (5, 'Eve', 19, '901 Maple Dr');

'''

"\n-- Create the Student table\nCREATE TABLE Student (\n    ID INT PRIMARY KEY NOT NULL,\n    Name VARCHAR(20) NOT NULL,\n    Age INT NOT NULL,\n    Address VARCHAR(25)\n);\n\n-- Insert records into the Student table\nINSERT INTO Student (ID, Name, Age, Address)\nVALUES (1, 'Alice', 20, '123 Main St'),\n       (2, 'Bob', 22, '456 Elm St'),\n       (3, 'Carol', 21, '789 Oak Ave'),\n       (4, 'David', 23, '567 Pine Rd'),\n       (5, 'Eve', 19, '901 Maple Dr');\n\n"